tools/k6/resultats/avant-2026-09-24/palier-50.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/macbookpro/klassio-saas/tools/k6/charge.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m27s max duration (incl. graceful stop):
              * matinee: Up to 50 looping VUs for 1m7s over 3 stages (gracefulRampDown: 20s, gracefulStop: 30s)


running (0m01.0s), 02/50 VUs, 0 complete and 0 interrupted iterations
matinee   [   1% ] 02/50 VUs  0m00.3s/1m07.0s

running (0m02.0s), 06/50 VUs, 0 complete and 0 interrupted iterations
matinee   [   2% ] 06/50 VUs  0m01.3s/1m07.0s

running (0m03.0s), 11/50 VUs, 0 complete and 0 interrupted iterations
matinee   [   3% ] 11/50 VUs  0m02.3s/1m07.0s

running (0m04.0s), 15/50 VUs, 0 complete and 0 interrupted iterations
matinee   [   5% ] 15/50 VUs  0m03.3s/1m07.0s

running (0m05.0s), 20/50 VUs, 0 complete and 0 interrupted iterations
matinee   [   6% ] 20/50 VUs  0m04.3s/1m07.0s

running (0m06.0s), 24/50 VUs, 0 complete and 0 interrupted iterations
matinee   [   8% ] 24/50 VUs  0m05.3s/1m07.0s

running (0m07.0s), 29/50 VUs, 4 complete and 0 interrupted iterations
matinee   [   9% ] 29/50 VUs  0m06.3s/1m07.0s

running (0m08.0s), 33/50 VUs, 6 complete and 0 interrupted iterations
matinee   [  11% ] 33/50 VUs  0m07.3s/1m07.0s

running (0m09.0s), 38/50 VUs, 9 complete and 0 interrupted iterations
matinee   [  12% ] 38/50 VUs  0m08.3s/1m07.0s

running (0m10.0s), 42/50 VUs, 13 complete and 0 interrupted iterations
matinee   [  14% ] 42/50 VUs  0m09.3s/1m07.0s

running (0m11.0s), 47/50 VUs, 20 complete and 0 interrupted iterations
matinee   [  15% ] 47/50 VUs  0m10.3s/1m07.0s

running (0m12.0s), 50/50 VUs, 25 complete and 0 interrupted iterations
matinee   [  17% ] 50/50 VUs  0m11.3s/1m07.0s

running (0m13.0s), 50/50 VUs, 28 complete and 0 interrupted iterations
matinee   [  18% ] 50/50 VUs  0m12.3s/1m07.0s

running (0m14.0s), 50/50 VUs, 35 complete and 0 interrupted iterations
matinee   [  20% ] 50/50 VUs  0m13.3s/1m07.0s

running (0m15.0s), 50/50 VUs, 43 complete and 0 interrupted iterations
matinee   [  21% ] 50/50 VUs  0m14.3s/1m07.0s

running (0m16.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
matinee   [  23% ] 50/50 VUs  0m15.3s/1m07.0s

running (0m17.0s), 50/50 VUs, 60 complete and 0 interrupted iterations
matinee   [  24% ] 50/50 VUs  0m16.3s/1m07.0s

running (0m18.0s), 50/50 VUs, 67 complete and 0 interrupted iterations
matinee   [  26% ] 50/50 VUs  0m17.3s/1m07.0s

running (0m19.0s), 50/50 VUs, 74 complete and 0 interrupted iterations
matinee   [  27% ] 50/50 VUs  0m18.3s/1m07.0s

running (0m20.0s), 50/50 VUs, 82 complete and 0 interrupted iterations
matinee   [  29% ] 50/50 VUs  0m19.3s/1m07.0s

running (0m21.0s), 50/50 VUs, 87 complete and 0 interrupted iterations
matinee   [  30% ] 50/50 VUs  0m20.3s/1m07.0s

running (0m22.0s), 50/50 VUs, 102 complete and 0 interrupted iterations
matinee   [  32% ] 50/50 VUs  0m21.3s/1m07.0s

running (0m23.0s), 50/50 VUs, 108 complete and 0 interrupted iterations
matinee   [  33% ] 50/50 VUs  0m22.3s/1m07.0s

running (0m24.0s), 50/50 VUs, 116 complete and 0 interrupted iterations
matinee   [  35% ] 50/50 VUs  0m23.3s/1m07.0s

running (0m25.0s), 50/50 VUs, 124 complete and 0 interrupted iterations
matinee   [  36% ] 50/50 VUs  0m24.3s/1m07.0s

running (0m26.0s), 50/50 VUs, 131 complete and 0 interrupted iterations
matinee   [  38% ] 50/50 VUs  0m25.3s/1m07.0s

running (0m27.0s), 50/50 VUs, 135 complete and 0 interrupted iterations
matinee   [  39% ] 50/50 VUs  0m26.3s/1m07.0s

running (0m28.0s), 50/50 VUs, 139 complete and 0 interrupted iterations
matinee   [  41% ] 50/50 VUs  0m27.3s/1m07.0s

running (0m29.0s), 50/50 VUs, 153 complete and 0 interrupted iterations
matinee   [  42% ] 50/50 VUs  0m28.3s/1m07.0s

running (0m30.0s), 50/50 VUs, 163 complete and 0 interrupted iterations
matinee   [  44% ] 50/50 VUs  0m29.3s/1m07.0s

running (0m31.0s), 50/50 VUs, 167 complete and 0 interrupted iterations
matinee   [  45% ] 50/50 VUs  0m30.3s/1m07.0s

running (0m32.0s), 50/50 VUs, 177 complete and 0 interrupted iterations
matinee   [  47% ] 50/50 VUs  0m31.3s/1m07.0s

running (0m33.0s), 50/50 VUs, 181 complete and 0 interrupted iterations
matinee   [  48% ] 50/50 VUs  0m32.3s/1m07.0s

running (0m34.0s), 50/50 VUs, 184 complete and 0 interrupted iterations
matinee   [  50% ] 50/50 VUs  0m33.3s/1m07.0s

running (0m35.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
matinee   [  51% ] 50/50 VUs  0m34.4s/1m07.0s

running (0m36.0s), 50/50 VUs, 203 complete and 0 interrupted iterations
matinee   [  53% ] 50/50 VUs  0m35.3s/1m07.0s

running (0m37.0s), 50/50 VUs, 216 complete and 0 interrupted iterations
matinee   [  54% ] 50/50 VUs  0m36.3s/1m07.0s

running (0m38.0s), 50/50 VUs, 223 complete and 0 interrupted iterations
matinee   [  56% ] 50/50 VUs  0m37.3s/1m07.0s

running (0m39.0s), 50/50 VUs, 232 complete and 0 interrupted iterations
matinee   [  57% ] 50/50 VUs  0m38.3s/1m07.0s

running (0m40.0s), 50/50 VUs, 236 complete and 0 interrupted iterations
matinee   [  59% ] 50/50 VUs  0m39.3s/1m07.0s

running (0m41.0s), 50/50 VUs, 241 complete and 0 interrupted iterations
matinee   [  60% ] 50/50 VUs  0m40.3s/1m07.0s

running (0m42.0s), 50/50 VUs, 247 complete and 0 interrupted iterations
matinee   [  62% ] 50/50 VUs  0m41.4s/1m07.0s

running (0m43.0s), 50/50 VUs, 254 complete and 0 interrupted iterations
matinee   [  63% ] 50/50 VUs  0m42.3s/1m07.0s

running (0m44.0s), 50/50 VUs, 261 complete and 0 interrupted iterations
matinee   [  65% ] 50/50 VUs  0m43.3s/1m07.0s

running (0m45.0s), 50/50 VUs, 272 complete and 0 interrupted iterations
matinee   [  66% ] 50/50 VUs  0m44.3s/1m07.0s

running (0m46.0s), 50/50 VUs, 285 complete and 0 interrupted iterations
matinee   [  68% ] 50/50 VUs  0m45.3s/1m07.0s

running (0m47.0s), 50/50 VUs, 290 complete and 0 interrupted iterations
matinee   [  69% ] 50/50 VUs  0m46.3s/1m07.0s

running (0m48.0s), 50/50 VUs, 293 complete and 0 interrupted iterations
matinee   [  71% ] 50/50 VUs  0m47.3s/1m07.0s

running (0m49.0s), 50/50 VUs, 298 complete and 0 interrupted iterations
matinee   [  72% ] 50/50 VUs  0m48.3s/1m07.0s

running (0m50.0s), 50/50 VUs, 301 complete and 0 interrupted iterations
matinee   [  74% ] 50/50 VUs  0m49.3s/1m07.0s

running (0m51.0s), 50/50 VUs, 310 complete and 0 interrupted iterations
matinee   [  75% ] 50/50 VUs  0m50.3s/1m07.0s

running (0m52.0s), 50/50 VUs, 328 complete and 0 interrupted iterations
matinee   [  77% ] 50/50 VUs  0m51.3s/1m07.0s

running (0m53.0s), 50/50 VUs, 336 complete and 0 interrupted iterations
matinee   [  78% ] 50/50 VUs  0m52.3s/1m07.0s

running (0m54.0s), 50/50 VUs, 340 complete and 0 interrupted iterations
matinee   [  80% ] 50/50 VUs  0m53.3s/1m07.0s

running (0m55.0s), 50/50 VUs, 347 complete and 0 interrupted iterations
matinee   [  81% ] 50/50 VUs  0m54.3s/1m07.0s

running (0m56.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
matinee   [  83% ] 50/50 VUs  0m55.3s/1m07.0s

running (0m57.0s), 50/50 VUs, 354 complete and 0 interrupted iterations
matinee   [  84% ] 50/50 VUs  0m56.3s/1m07.0s

running (0m58.0s), 48/50 VUs, 362 complete and 0 interrupted iterations
matinee   [  86% ] 48/50 VUs  0m57.3s/1m07.0s

running (0m59.0s), 47/50 VUs, 373 complete and 0 interrupted iterations
matinee   [  87% ] 47/50 VUs  0m58.3s/1m07.0s

running (1m00.0s), 46/50 VUs, 381 complete and 0 interrupted iterations
matinee   [  89% ] 46/50 VUs  0m59.3s/1m07.0s

running (1m01.0s), 41/50 VUs, 394 complete and 0 interrupted iterations
matinee   [  90% ] 41/50 VUs  1m00.3s/1m07.0s

running (1m02.0s), 36/50 VUs, 400 complete and 0 interrupted iterations
matinee   [  92% ] 36/50 VUs  1m01.3s/1m07.0s

running (1m03.0s), 34/50 VUs, 404 complete and 0 interrupted iterations
matinee   [  93% ] 34/50 VUs  1m02.3s/1m07.0s

running (1m04.0s), 30/50 VUs, 412 complete and 0 interrupted iterations
matinee   [  95% ] 30/50 VUs  1m03.3s/1m07.0s

running (1m05.0s), 25/50 VUs, 420 complete and 0 interrupted iterations
matinee   [  96% ] 25/50 VUs  1m04.3s/1m07.0s

running (1m06.0s), 22/50 VUs, 425 complete and 0 interrupted iterations
matinee   [  98% ] 22/50 VUs  1m05.3s/1m07.0s

running (1m07.0s), 16/50 VUs, 432 complete and 0 interrupted iterations
matinee   [  99% ] 16/50 VUs  1m06.3s/1m07.0s

running (1m08.0s), 11/50 VUs, 438 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 14/50 VUs  1m7s

running (1m09.0s), 08/50 VUs, 441 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 14/50 VUs  1m7s

running (1m10.0s), 08/50 VUs, 441 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 14/50 VUs  1m7s

running (1m11.0s), 05/50 VUs, 444 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 14/50 VUs  1m7s

running (1m12.0s), 02/50 VUs, 447 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 14/50 VUs  1m7s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{name:login}
    ✓ 'p(95)<3000' p(95)=217.32ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    klassio_dossier_eleve
    ✓ 'p(95)<500' p(95)=324.71ms

    klassio_liste_eleves
    ✓ 'p(95)<1500' p(95)=457.94ms

    klassio_rapports
    ✓ 'p(95)<1200' p(95)=508.57ms

    klassio_tableau_de_bord
    ✓ 'p(95)<800' p(95)=405.75ms


  █ TOTAL RESULTS 

    checks_total.......: 6735    92.615346/s
    checks_succeeded...: 100.00% 6735 out of 6735
    checks_failed......: 0.00%   0 out of 6735

    ✓ tableau de bord : 200
    ✓ tableau de bord : champs attendus
    ✓ élèves : 200
    ✓ élèves : liste non vide
    ✓ élèves : champ « code » présent
    ✓ dossier : 200
    ✓ dossier : champs attendus
    ✓ rapports : 200
    ✓ rapports : champs attendus
    ✓ classes : 200
    ✓ classes : liste non vide
    ✓ classes : champ « name » présent
    ✓ enfants : 200
    ✓ enfants : liste non vide
    ✓ enfants : champ « code » présent

    CUSTOM
    klassio_dossier_eleve..........: med=44.54ms  p(90)=250.19ms p(95)=324.71ms p(99)=465.54ms max=520.29ms
    klassio_liste_eleves...........: med=159.28ms p(90)=376.86ms p(95)=457.94ms p(99)=609.44ms max=754.09ms
    klassio_rapports...............: med=211.8ms  p(90)=427.62ms p(95)=508.57ms p(99)=676.36ms max=825.13ms
    klassio_tableau_de_bord........: med=132.25ms p(90)=341.52ms p(95)=405.75ms p(99)=507.06ms max=639.17ms

    HTTP
    http_req_duration..............: med=81.4ms   p(90)=316.36ms p(95)=392.83ms p(99)=534.46ms max=825.13ms
      { expected_response:true }...: med=81.4ms   p(90)=316.36ms p(95)=392.83ms p(99)=534.46ms max=825.13ms
      { name:login }...............: med=210.7ms  p(90)=216.58ms p(95)=217.32ms p(99)=217.91ms max=218.06ms
    http_req_failed................: 0.00%  0 out of 3595
    http_reqs......................: 3595   49.436105/s

    EXECUTION
    iteration_duration.............: med=6.55s    p(90)=8.13s    p(95)=8.54s    p(99)=9.19s    max=9.96s   
    iterations.....................: 449    6.174356/s
    vus............................: 2      min=2         max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 358 MB 4.9 MB/s
    data_sent......................: 578 kB 8.0 kB/s



running (1m12.7s), 00/50 VUs, 449 complete and 0 interrupted iterations
matinee ✓ [ 100% ] 00/50 VUs  1m7s